In [2]:
import pandas as pd
import os
import shutil

In [3]:
df0 = pd.read_csv('./bidder1_collaboration.csv')
df1 = pd.read_csv('./diff_all.csv')
df0.shape, df1.shape

((26349, 4), (986, 8))

In [10]:
df1['ID']=df1['Index']+1

In [12]:
# df1.head()

In [13]:
joined = df0.set_index('ID').join(df1.set_index('ID'), how='inner')[['Name','Pic_ID','Label_J','Label_W','set_J','Pic_J']]
joined.shape

(986, 6)

In [14]:
joined.head()

                    Name  Pic_ID Label_J Label_W  set_J  Pic_J
ID
32   1574296_profile.jpg      32       F       G      1     32
43   1478207_profile.jpg      43       F       M      1     43
73    656115_profile.jpg      73       F       B      1     73
97   1353234_profile.jpg      97       M       B      1     97
112  1385692_profile.jpg      12       M       B      2     12

In [15]:
joined = joined.drop('Pic_ID', axis=1)
joined.head()

                    Name Label_J Label_W  set_J  Pic_J
ID
32   1574296_profile.jpg       F       G      1     32
43   1478207_profile.jpg       F       M      1     43
73    656115_profile.jpg       F       B      1     73
97   1353234_profile.jpg       M       B      1     97
112  1385692_profile.jpg       M       B      2     12

In [16]:
joined = joined[['Name','set_J','Pic_J','Label_J','Label_W']]

In [17]:
joined.head()

                    Name  set_J  Pic_J Label_J Label_W
ID
32   1574296_profile.jpg      1     32       F       G
43   1478207_profile.jpg      1     43       F       M
73    656115_profile.jpg      1     73       F       B
97   1353234_profile.jpg      1     97       M       B
112  1385692_profile.jpg      2     12       M       B

In [18]:
joined.columns

Index([u'Name', u'set_J', u'Pic_J', u'Label_J', u'Label_W'], dtype='object')

In [19]:
joined.columns=['Name','Set_ID','Pic_ID','Label_J','Label_W']

In [20]:
joined.head()

                    Name  Set_ID  Pic_ID Label_J Label_W
ID
32   1574296_profile.jpg       1      32       F       G
43   1478207_profile.jpg       1      43       F       M
73    656115_profile.jpg       1      73       F       B
97   1353234_profile.jpg       1      97       M       B
112  1385692_profile.jpg       2      12       M       B

In [21]:
joined.to_csv('diff_all_withPath.csv', index_label='Index')

In [22]:
!pwd

/home/iri/pics/diff_Pics

In [23]:
! ls ../Flask/static/bidderPics/|wc

  26349   26349  519075

In [24]:
path = '../Flask/static/bidderPics/'

In [25]:
!ls

bidder1_collaboration.csv  diff_all.csv  diff_all_withPath.csv	join.ipynb

In [27]:
!pwd

/home/iri/pics/diff_Pics

In [28]:
!rm diff_Pics -r

rm: cannot remove 'diff_Pics': No such file or directory

In [29]:
!mkdir diff_Pics

In [30]:
for i in joined['Name']:
    print i
    break

1574296_profile.jpg

In [31]:
%%time
fail=[]
for i in joined['Name']:
    try:
        shutil.copy(path+i, 'diff_Pics/'+i)
    except:
        fail.append(i)
print len(fail)

0
CPU times: user 60 ms, sys: 100 ms, total: 160 ms
Wall time: 880 ms

In [32]:
!ls diff_Pics/|wc

    986     986   19446

In [33]:
! ls ../Flask/static/diff_Pics/|wc

    986     986   19428

In [35]:
! rm ../Flask/static/diff_Pics/ -r

In [36]:
! ls ../Flask/static/diff_Pics/|wc

ls: cannot access '../Flask/static/diff_Pics/': No such file or directory
      0       0       0

In [38]:
! mkdir ../Flask/static/diff_Pics/

In [39]:
! mv diff_Pics/ ../Flask/static/

In [40]:
! ls ../Flask/static/diff_Pics/|wc

    986     986   19446

In [41]:
!ls ../Flask/static

addbidderPics  bidderPics  css	    diff_Pics
addbossPics    bossPics    css.zip  template.xlsx